import { Copywrite } from "../../footer/copyright";
import { Footer } from "../../footer/footer";
import { Header } from "../../header/header";
import { CenterDivider } from "../../diveder/centerDivider";
import { Badge } from "../../badges/badge";
import { RightDivider } from "../../diveder/rightDivider";

export const TenFactsAboutInstagram = ()=>(
    <>
        <Header/>
        <div className='container-fluid' style={{background:'#F4F4F4'}}>
            <div className='pt-5' style={{margin:'0px 100px'}}>
                <div className='row'>
                    <div className='col-lg-9 mb-5'>
                        <div className='text-center'>
                            <div className='position-relative' >
                                <img 
                                    className='positin-relative rounded' 
                                    src='img/InstagramAlgorithm.jpg' 
                                    style={{width:'90%'}} 
                                    alt=''
                                />
                            <Badge 
                                badgeDate='23'
                                badgeMonth='مرداد'
                                top='20px'
                                right='70px'
                            />
                            </div>
                            <div className='py-3' style={{background:'white', width:'90%', marginRight:'47px'}}>
                                <p>تولید محتوا</p>
                                <h3 className='text-success' style={{fontWeight:'bold'}}>10 حقیقت مهم درباره الگوریتم اینستاگرام</h3>
                                <CenterDivider 
                                    width='50px'
                                    color='gray'
                                />
                                <p>زمان مطالعه : 5 دقیقه</p>
                                <img 
                                    src='img/rating_stars.png' 
                                    style={{width:'180px', marginTop:'-30px'}} 
                                    alt=''
                                />
                                <div className='px-4' style={{textAlign:'right', fontSize:'18px'}}>
                                    <p>شایعات زیادی درباره الگوریتم اینستاگرام وجود دارد، اما ما 10 حقیقت مهم درباره این الگوریتم را با شما به اشتراک می‌گذاریم که توسط خود اینستاگرام هم تایید شده است.</p>
                                    <h5 className='text-success' style={{fontWeight:'bold'}}>1. اینستاگرام چند الگوریتم مختلف دارد که با هم کار می‌کنند</h5>
                                    <p>شاید اغلب، واژه الگوریتم اینستاگرام را شنیده باشید و فکر کنید که اینستاگرام فقط یک الگوریتم دارد، اما در واقع الگوریتم‌های مختلفی هم‌زمان در این اپ اجرا می‌شوند. مثلا، الگوریتم بخش فید با الگوریتم صفحه اکسپلور و الگوریتم IGTV با الگوریتم ریلز فرق دارد. با اینکه هر الگوریتم کمی با دیگری فرق دارد، اما همه آن‌ها بر اساس یک اصل واحد کار می‌کنند و آن ارائه جذاب‌ترین محتوا به هر کاربر بر اساس علایق او است.</p>
                                    <h5 className='text-success' style={{fontWeight:'bold'}}>2. الگوریتم بخش فید، پست‌ها را بر اساس چهار عامل کلیدی رتبه‌بندی می‌کند</h5>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <p>آدام موسری، رئیس اینستاگرام، عوامل زیر را برای الگوریتم بخش فید مهم می‌داند:
                                        اطلاعات مربوط به خود پست. عکس است یا ویدیو؟درباره چه موضوعی است؟ آیا لایک‌های زیادی گرفته؟
                                        اطلاعات مربوط به شخص پست‌گذار. آیا دوست شما است؟آیا اغلب پست می‌گذارد؟
                                        فعالیت شما.آیا تمایل دارید ویدیوهای زیادی تماشا کنید؟ معمولا چه محتواهایی برایتان جذاب است؟
                                        سابقه تعامل شما با آن شخص. آیا اغلب پست‌‌های این شخص را لایک می‌کنید و زیر آن‌ها کامنت می‌گذارید؟
                                        الگوریتم بر اساس این اطلاعات، احتمال تعامل کاربر با یک پست را بررسی می‌کند که به آن «میزان علاقه‌مندی» می‌گویند و پست‌‌ها بر این اساس مرتب شده و در فید کاربر نمایش داده می‌شوند.
                                    </p>
                                    <div className='text-center mt-5'>
                                        <img 
                                            className='text-center'
                                             src='img/rating_stars.png' 
                                             style={{width:'250px', marginTop:'-30px'}} 
                                             alt=''
                                        />
                                        <p>میانگین امتیاز : 4.4 /5</p>
                                        <h5 className='text-success mt-5' style={{fontWeight:'bold'}}>این مطالب را هم حتما بخوانید</h5>
                                        <CenterDivider 
                                            width='30px'
                                            color='gray'
                                        />
                                        <div className='d-flex' style={{margin:'20px 70px'}}>
                                            <div>
                                                <img 
                                                    src='img/Instagram-featured.jpg' 
                                                    style={{width:'161px', height:'90px'}} 
                                                    className='rounded'
                                                    alt=''
                                                    />
                                                <h6 style={{fontWeight:'bold', marginTop:'10px'}}>روش استفاده از اینستاگرام</h6>
                                            </div>
                                            <div style={{marginRight:'10px'}}>
                                                <img 
                                                    src='img/SevenStrategyQuestions-featured.jpg' 
                                                    style={{width:'161px', height:'90px'}} 
                                                    className='rounded'
                                                    alt=''
                                                    />
                                                <h6 style={{fontWeight:'bold', marginTop:'10px'}}>خلاصه کتاب 7 سوال درباره استراتژی</h6>
                                            </div>
                                            <div style={{marginRight:'10px'}}>
                                                <img 
                                                    src='img/Products-featured.jpg' 
                                                    style={{width:'161px', height:'90px'}} 
                                                    className='rounded'
                                                    alt=''
                                                    />
                                                <h6 style={{fontWeight:'bold', marginTop:'10px'}}>خلاصه کتاب 7 سوال درباره استراتژی</h6>
                                            </div>
                                            <div style={{marginRight:'10px'}}>
                                                <img 
                                                    src='img/SeoSkill-featured.jpg' 
                                                    style={{width:'161px', height:'90px'}} 
                                                    className='rounded'
                                                    alt=''
                                                />
                                                <h6 style={{fontWeight:'bold', marginTop:'10px'}}>خلاصه کتاب 7 سوال درباره استراتژی</h6>
                                            </div>
                                        </div>
                                    </div>

                                </div>
                            </div>
                            <div 
                                className='py-5 px-3'
                                style={{background:'white',margin:'30px 48px', textAlignLast:'right'}}
                            >
                                <h3 className='text-success'>دیدگاهتان را بنویسید</h3>
                                <p>نشانی ایمیل شما منتشر نخواهد شد</p>
                                <form className='form-group' style={{margin:'0px auto', width:'90%'}}>
                                    <label className='mb-2' for='note' style={{fontWeight:'bold'}}>دیدگاه</label>
                                    <textarea 
                                        id='note'
                                        className='form-control' 
                                        rows='5'
                                    >
                                    </textarea>
                                    <div className='row mt-3'>
                                        <div className='col' >
                                            <label className='mb-2' for='lName' style={{fontWeight:'bold'}} >نام</label>
                                            <input className='form-control' id='lName' type='text' name='lName' />
                                        </div>
                                        <div className='col' >
                                            <label className='mb-2' for='fName' style={{fontWeight:'bold'}}>ایمیل</label>
                                            <input className='form-control' id='fName' type='email' name='email' />
                                        </div>
                                    </div>
                                    <div className='form-group mt-4'>
                                        <select className='form-control'>
                                            <option className='selected'>فقط دریافت پاسخ دیدگاه های خودم</option>
                                            <option>مشترک نمی شوم</option>
                                            <option>دریافت همه دیدگاه های این نوشته</option>
                                            <option>فقط دریافت دیدگاه های پاسخ خودم</option>
                                        </select>
                                    </div>
                                    <p className='mt-3' style={{fontWeight:'bold'}}>من را با ایمیل از دیدگاه های آتی این نوشته مطلع کنید. همچنین می توانید بدون ارسال دیدگاه مشترک شوید</p>
                                    <button className='btn-lg btn-success'>فرستادن دیدگاه</button>
                                </form>
                            </div> 
                        </div>
                    </div>
                    <div className='col-lg-3 py-4 rounded' style={{background:'white', height:'50%'}} >
                        <img 
                            src='img/ads.jpg' 
                            style={{width:'300px', height:'300px'}} 
                            alt=''
                        />
                        <h5 className='mt-3' style={{fontWeight:'bold'}}>این مطلب را هم بخوانید</h5>
                        <RightDivider 
                            width='30px'
                        />
                        <img 
                            className='mt-3' 
                            src='img/ContentMarketingTips.jpg' 
                            style={{width:'300px', height:'170px'}} 
                            alt=''
                        />
                        <h5 className='mt-4'>هشت نکته مهم درباره بازاریابی محتوا</h5>
                        <img 
                            className='mt-3' 
                            src='img/InstagraMarketing.jpg' 
                            style={{width:'300px', height:'170px'}}
                            alt=''
                         />
                        <h5 className='mt-4'>11 روند مهم بازاریابی اینستاگرام</h5>
                        <img 
                            className='mt-3' 
                            src='img/PresentationTips.jpg' 
                            style={{width:'300px', height:'170px'}} 
                            alt=''
                        />
                        <h5 className='mt-4'>نکاتی درباره سخنرانی خوب</h5>
                        <img 
                            className='mt-3' 
                            src='img/Rework-book-summary.jpg' 
                            style={{width:'300px', height:'170px'}} 
                            alt=''
                        />
                        <h5 className='mt-4'>6 دیدگاه دور ریختنی درباره کسب و کار</h5>
                    </div>
                </div>
            </div>
        </div>
        <Footer />
        <Copywrite />
    </>
);